Tekla Open API Reference for Tekla Structures 2025
Filter Methods
The Filter type exposes the following members.
Methods
Name | Description
CreateFile
 Creates a filter and saves it as a text file.
ToString
 Returns the current FilterExpression as a string.
 (Overrides Object.ToString().)
Top
See Also
Reference
Filter Class
Tekla.Structures.Filtering Namespace